NyankoLab/esp32c3-elf/module/symbols.c
    // common
    ESP_ELFSYM_EXPORT(init_udp_console),
    ESP_ELFSYM_EXPORT(execv),
    ESP_ELFSYM_EXPORT(uart0_tx),
    ESP_ELFSYM_EXPORT(uart0_rx),
    ESP_ELFSYM_EXPORT(uart1_tx),
    ESP_ELFSYM_EXPORT(uart1_rx),
    ESP_ELFSYM_EXPORT(ap_netif),
    ESP_ELFSYM_EXPORT(eth_netif),
    ESP_ELFSYM_EXPORT(sta_netif),
    ESP_ELFSYM_EXPORT(httpd_server),

    // other
    ESP_ELFSYM_EXPORT(esp_app_desc),
    ESP_ELFSYM_EXPORT(esp_clk_apb_freq),
    ESP_ELFSYM_EXPORT(esp_get_idf_version),
    ESP_ELFSYM_EXPORT(esp_restart),
    ESP_ELFSYM_EXPORT(esp_timer_get_time),
    ESP_ELFSYM_EXPORT(g_wifi_default_wpa_crypto_funcs),
    ESP_ELFSYM_EXPORT(g_wifi_osi_funcs),
    ESP_ELFSYM_EXPORT(lwip_ioctl),
    ESP_ELFSYM_EXPORT(lwip_close),
    ESP_ELFSYM_EXPORT(periph_module_enable),
    ESP_ELFSYM_EXPORT(periph_module_reset),
    ESP_ELFSYM_EXPORT(uart_periph_signal),
    ESP_ELFSYM_EXPORT(GPIO_PIN_MUX_REG),
    ESP_ELFSYM_EXPORT(IP_EVENT),
    ESP_ELFSYM_EXPORT(WIFI_EVENT),

    // ethernet
    ESP_ELFSYM_EXPORT(ethernet),

    // httpd
    ESP_ELFSYM_EXPORT(httpd_start),
    ESP_ELFSYM_EXPORT(httpd_register_uri_handler),
    ESP_ELFSYM_EXPORT(httpd_unregister_uri_handler),
    ESP_ELFSYM_EXPORT(httpd_req_get_url_query_len),
    ESP_ELFSYM_EXPORT(httpd_req_get_url_query_str),
    ESP_ELFSYM_EXPORT(httpd_req_url_decode),
    ESP_ELFSYM_EXPORT(httpd_query_key_value),
    ESP_ELFSYM_EXPORT(httpd_query_decode_key_value),
    ESP_ELFSYM_EXPORT(httpd_resp_redirect),
    ESP_ELFSYM_EXPORT(httpd_resp_send),
    ESP_ELFSYM_EXPORT(httpd_resp_send_chunk),
    ESP_ELFSYM_EXPORT(httpd_resp_set_status),
    ESP_ELFSYM_EXPORT(httpd_resp_set_type),
    ESP_ELFSYM_EXPORT(httpd_resp_set_hdr),

    // https
    ESP_ELFSYM_EXPORT(https_connect),
    ESP_ELFSYM_EXPORT(https_disconnect),
    ESP_ELFSYM_EXPORT(https_send),
    ESP_ELFSYM_EXPORT(https_callback),

    // lcd
    ESP_ELFSYM_EXPORT(lcd_init),
    ESP_ELFSYM_EXPORT(lcd_text),

    // mqtt
    ESP_ELFSYM_EXPORT(mqtt_prefix),
    ESP_ELFSYM_EXPORT(mqtt_publish),
    ESP_ELFSYM_EXPORT(mqtt_receive),
    ESP_ELFSYM_EXPORT(mqtt_setup),
    ESP_ELFSYM_EXPORT(mqtt_connected),
    ESP_ELFSYM_EXPORT(mqtt_connected_internal),
    ESP_ELFSYM_EXPORT(mqtt_ready_internal),

    // ota
    ESP_ELFSYM_EXPORT(ota_init),

    // sntp
    ESP_ELFSYM_EXPORT(sntp_setoperatingmode),
    ESP_ELFSYM_EXPORT(sntp_getoperatingmode),
    ESP_ELFSYM_EXPORT(sntp_init),
    ESP_ELFSYM_EXPORT(sntp_stop),
    ESP_ELFSYM_EXPORT(sntp_enabled),
    ESP_ELFSYM_EXPORT(sntp_setserver),
    ESP_ELFSYM_EXPORT(sntp_getserver),
#if SNTP_MONITOR_SERVER_REACHABILITY
    ESP_ELFSYM_EXPORT(sntp_getreachability),
#endif
#if SNTP_SERVER_DNS
    ESP_ELFSYM_EXPORT(sntp_setservername),
    ESP_ELFSYM_EXPORT(sntp_getservername),
#endif
#if SNTP_GET_SERVERS_FROM_DHCP || SNTP_GET_SERVERS_FROM_DHCPV6
    ESP_ELFSYM_EXPORT(sntp_servermode_dhcp),
#endif

    // i2c
//  ESP_ELFSYM_EXPORT(i2c_new_master_bus),

    // spi_slave
    ESP_ELFSYM_EXPORT(spi_slave_initialize),
//  ESP_ELFSYM_EXPORT(spi_slave_free),
    ESP_ELFSYM_EXPORT(spi_slave_queue_trans),
    ESP_ELFSYM_EXPORT(spi_slave_get_trans_result),
    ESP_ELFSYM_EXPORT(spi_slave_transmit),

    // temperature
    ESP_ELFSYM_EXPORT(temperature_init),
    ESP_ELFSYM_EXPORT(temperature),

    // wifi
    ESP_ELFSYM_EXPORT(wifi_ap),
    ESP_ELFSYM_EXPORT(wifi_sta),

    // esp_adc
//  ESP_ELFSYM_EXPORT(esp_adc_cal_characterize),
//  ESP_ELFSYM_EXPORT(esp_adc_cal_raw_to_voltage),
//  ESP_ELFSYM_EXPORT(esp_adc_cal_get_voltage),
    ESP_ELFSYM_EXPORT(adc_oneshot_config_channel),
    ESP_ELFSYM_EXPORT(adc_oneshot_new_unit),
    ESP_ELFSYM_EXPORT(adc_oneshot_read),
    ESP_ELFSYM_EXPORT(adc_cali_create_scheme_curve_fitting),
    ESP_ELFSYM_EXPORT(adc_cali_raw_to_voltage),

    // esp_event
//  ESP_ELFSYM_EXPORT(esp_event_loop_create),
//  ESP_ELFSYM_EXPORT(esp_event_loop_delete),
    ESP_ELFSYM_EXPORT(esp_event_loop_create_default),
//  ESP_ELFSYM_EXPORT(esp_event_loop_delete_default),
//  ESP_ELFSYM_EXPORT(esp_event_loop_run),
//  ESP_ELFSYM_EXPORT(esp_event_handler_register),
//  ESP_ELFSYM_EXPORT(esp_event_handler_register_with),
//  ESP_ELFSYM_EXPORT(esp_event_handler_instance_register_with),
    ESP_ELFSYM_EXPORT(esp_event_handler_instance_register),
//  ESP_ELFSYM_EXPORT(esp_event_handler_unregister),
//  ESP_ELFSYM_EXPORT(esp_event_handler_unregister_with),
//  ESP_ELFSYM_EXPORT(esp_event_handler_instance_unregister_with),
//  ESP_ELFSYM_EXPORT(esp_event_handler_instance_unregister),
//  ESP_ELFSYM_EXPORT(esp_event_post),
//  ESP_ELFSYM_EXPORT(esp_event_post_to),
#if CONFIG_ESP_EVENT_POST_FROM_ISR
//  ESP_ELFSYM_EXPORT(esp_event_isr_post),
//  ESP_ELFSYM_EXPORT(esp_event_isr_post_to),
#endif
//  ESP_ELFSYM_EXPORT(esp_event_dump),

    // esp_lcd
//  ESP_ELFSYM_EXPORT(esp_lcd_new_panel_io_i2c_v1),
//  ESP_ELFSYM_EXPORT(esp_lcd_new_panel_io_i2c_v2),
//  ESP_ELFSYM_EXPORT(esp_lcd_new_panel_ssd1306),
//  ESP_ELFSYM_EXPORT(esp_lcd_panel_init),
//  ESP_ELFSYM_EXPORT(esp_lcd_panel_disp_on_off),
//  ESP_ELFSYM_EXPORT(esp_lcd_panel_draw_bitmap),
//  ESP_ELFSYM_EXPORT(esp_lcd_panel_reset),

    // esp_log
    ESP_ELFSYM_EXPORT(esp_log),
//  ESP_ELFSYM_EXPORT(esp_log_level_set),
//  ESP_ELFSYM_EXPORT(esp_log_level_get),
//  ESP_ELFSYM_EXPORT(esp_log_set_vprintf),
    ESP_ELFSYM_EXPORT(esp_log_timestamp),
//  ESP_ELFSYM_EXPORT(esp_log_system_timestamp),
//  ESP_ELFSYM_EXPORT(esp_log_early_timestamp),
    ESP_ELFSYM_EXPORT(esp_log_write),
//  ESP_ELFSYM_EXPORT(esp_log_writev),

    // esp_netif
    ESP_ELFSYM_EXPORT(esp_netif_init),
//  ESP_ELFSYM_EXPORT(esp_netif_deinit),
//  ESP_ELFSYM_EXPORT(esp_netif_new),
//  ESP_ELFSYM_EXPORT(esp_netif_destroy),
//  ESP_ELFSYM_EXPORT(esp_netif_set_driver_config),
//  ESP_ELFSYM_EXPORT(esp_netif_attach),
//  ESP_ELFSYM_EXPORT(esp_netif_receive),
//  ESP_ELFSYM_EXPORT(esp_netif_action_start),
//  ESP_ELFSYM_EXPORT(esp_netif_action_stop),
//  ESP_ELFSYM_EXPORT(esp_netif_action_connected),
//  ESP_ELFSYM_EXPORT(esp_netif_action_disconnected),
//  ESP_ELFSYM_EXPORT(esp_netif_action_got_ip),
//  ESP_ELFSYM_EXPORT(esp_netif_action_join_ip6_multicast_group),
//  ESP_ELFSYM_EXPORT(esp_netif_action_leave_ip6_multicast_group),
//  ESP_ELFSYM_EXPORT(esp_netif_action_add_ip6_address),
//  ESP_ELFSYM_EXPORT(esp_netif_action_remove_ip6_address),
//  ESP_ELFSYM_EXPORT(esp_netif_set_default_netif),
//  ESP_ELFSYM_EXPORT(esp_netif_get_default_netif),
#if CONFIG_ESP_NETIF_BRIDGE_EN
//  ESP_ELFSYM_EXPORT(esp_netif_bridge_add_port),
//  ESP_ELFSYM_EXPORT(esp_netif_bridge_fdb_add),
//  ESP_ELFSYM_EXPORT(esp_netif_bridge_fdb_remove),
#endif
//  ESP_ELFSYM_EXPORT(esp_netif_join_ip6_multicast_group),
//  ESP_ELFSYM_EXPORT(esp_netif_leave_ip6_multicast_group),
//  ESP_ELFSYM_EXPORT(esp_netif_set_mac),
    ESP_ELFSYM_EXPORT(esp_netif_get_mac),
    ESP_ELFSYM_EXPORT(esp_netif_set_hostname),
    ESP_ELFSYM_EXPORT(esp_netif_get_hostname),
//  ESP_ELFSYM_EXPORT(esp_netif_is_netif_up),
    ESP_ELFSYM_EXPORT(esp_netif_get_ip_info),
//  ESP_ELFSYM_EXPORT(esp_netif_get_old_ip_info),
//  ESP_ELFSYM_EXPORT(esp_netif_set_ip_info),
//  ESP_ELFSYM_EXPORT(esp_netif_set_old_ip_info),
//  ESP_ELFSYM_EXPORT(esp_netif_get_netif_impl_index),
//  ESP_ELFSYM_EXPORT(esp_netif_get_netif_impl_name),
//  ESP_ELFSYM_EXPORT(esp_netif_napt_enable),
//  ESP_ELFSYM_EXPORT(esp_netif_napt_disable),
//  ESP_ELFSYM_EXPORT(esp_netif_dhcps_option),
//  ESP_ELFSYM_EXPORT(esp_netif_dhcpc_option),
//  ESP_ELFSYM_EXPORT(esp_netif_dhcpc_start),
//  ESP_ELFSYM_EXPORT(esp_netif_dhcpc_stop),
//  ESP_ELFSYM_EXPORT(esp_netif_dhcpc_get_status),
//  ESP_ELFSYM_EXPORT(esp_netif_dhcps_get_status),
//  ESP_ELFSYM_EXPORT(esp_netif_dhcps_start),
//  ESP_ELFSYM_EXPORT(esp_netif_dhcps_stop),
//  ESP_ELFSYM_EXPORT(esp_netif_dhcps_get_clients_by_mac),
//  ESP_ELFSYM_EXPORT(esp_netif_set_dns_info),
//  ESP_ELFSYM_EXPORT(esp_netif_get_dns_info),
#if CONFIG_LWIP_IPV6
//  ESP_ELFSYM_EXPORT(esp_netif_create_ip6_linklocal),
//  ESP_ELFSYM_EXPORT(esp_netif_get_ip6_linklocal),
//  ESP_ELFSYM_EXPORT(esp_netif_get_ip6_global),
//  ESP_ELFSYM_EXPORT(esp_netif_get_all_ip6),
//  ESP_ELFSYM_EXPORT(esp_netif_add_ip6_address),
//  ESP_ELFSYM_EXPORT(esp_netif_remove_ip6_address),
#endif
//  ESP_ELFSYM_EXPORT(esp_netif_set_ip4_addr),
    ESP_ELFSYM_EXPORT(esp_ip4addr_ntoa),
//  ESP_ELFSYM_EXPORT(esp_ip4addr_aton),
//  ESP_ELFSYM_EXPORT(esp_netif_str_to_ip4),
//  ESP_ELFSYM_EXPORT(esp_netif_str_to_ip6),
//  ESP_ELFSYM_EXPORT(esp_netif_get_io_driver),
//  ESP_ELFSYM_EXPORT(esp_netif_get_handle_from_ifkey),
//  ESP_ELFSYM_EXPORT(esp_netif_get_flags),
//  ESP_ELFSYM_EXPORT(esp_netif_get_ifkey),
//  ESP_ELFSYM_EXPORT(esp_netif_get_desc),
//  ESP_ELFSYM_EXPORT(esp_netif_get_route_prio),
//  ESP_ELFSYM_EXPORT(esp_netif_get_event_id),
//  ESP_ELFSYM_EXPORT(esp_netif_next_unsafe),
//  ESP_ELFSYM_EXPORT(esp_netif_find_if),
//  ESP_ELFSYM_EXPORT(esp_netif_get_nr_of_ifs),
//  ESP_ELFSYM_EXPORT(esp_netif_netstack_buf_ref),
//  ESP_ELFSYM_EXPORT(esp_netif_netstack_buf_free),
//  ESP_ELFSYM_EXPORT(esp_netif_tcpip_exec),

