NyankoLab/esp32c3-elf/module/symbols.c
    // esp_ota
    ESP_ELFSYM_EXPORT(esp_ota_begin),
//  ESP_ELFSYM_EXPORT(esp_ota_write),
    ESP_ELFSYM_EXPORT(esp_ota_write_with_offset),
    ESP_ELFSYM_EXPORT(esp_ota_end),
//  ESP_ELFSYM_EXPORT(esp_ota_abort),
    ESP_ELFSYM_EXPORT(esp_ota_set_boot_partition),
//  ESP_ELFSYM_EXPORT(esp_ota_get_boot_partition),
//  ESP_ELFSYM_EXPORT(esp_ota_get_running_partition),
    ESP_ELFSYM_EXPORT(esp_ota_get_next_update_partition),
//  ESP_ELFSYM_EXPORT(esp_ota_get_partition_description),
//  ESP_ELFSYM_EXPORT(esp_ota_get_bootloader_description),
//  ESP_ELFSYM_EXPORT(esp_ota_get_app_partition_count),
//  ESP_ELFSYM_EXPORT(esp_ota_mark_app_valid_cancel_rollback),
//  ESP_ELFSYM_EXPORT(esp_ota_mark_app_invalid_rollback_and_reboot),
//  ESP_ELFSYM_EXPORT(esp_ota_get_last_invalid_partition),
//  ESP_ELFSYM_EXPORT(esp_ota_get_state_partition),
//  ESP_ELFSYM_EXPORT(esp_ota_erase_last_boot_app_partition),
//  ESP_ELFSYM_EXPORT(esp_ota_check_rollback_is_possible),

    // esp_wifi
    ESP_ELFSYM_EXPORT(esp_wifi_init),
//  ESP_ELFSYM_EXPORT(esp_wifi_deinit),
    ESP_ELFSYM_EXPORT(esp_wifi_set_mode),
    ESP_ELFSYM_EXPORT(esp_wifi_get_mode),
    ESP_ELFSYM_EXPORT(esp_wifi_start),
//  ESP_ELFSYM_EXPORT(esp_wifi_stop),
//  ESP_ELFSYM_EXPORT(esp_wifi_restore),
    ESP_ELFSYM_EXPORT(esp_wifi_connect),
    ESP_ELFSYM_EXPORT(esp_wifi_disconnect),
//  ESP_ELFSYM_EXPORT(esp_wifi_clear_fast_connect),
//  ESP_ELFSYM_EXPORT(esp_wifi_deauth_sta),
//  ESP_ELFSYM_EXPORT(esp_wifi_scan_start),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_scan_parameters),
//  ESP_ELFSYM_EXPORT(esp_wifi_get_scan_parameters),
//  ESP_ELFSYM_EXPORT(esp_wifi_scan_stop),
//  ESP_ELFSYM_EXPORT(esp_wifi_scan_get_ap_num),
//  ESP_ELFSYM_EXPORT(esp_wifi_scan_get_ap_records),
//  ESP_ELFSYM_EXPORT(esp_wifi_scan_get_ap_record),
//  ESP_ELFSYM_EXPORT(esp_wifi_clear_ap_list),
    ESP_ELFSYM_EXPORT(esp_wifi_sta_get_ap_info),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_ps),
//  ESP_ELFSYM_EXPORT(esp_wifi_get_ps),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_protocol),
//  ESP_ELFSYM_EXPORT(esp_wifi_get_protocol),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_bandwidth),
//  ESP_ELFSYM_EXPORT(esp_wifi_get_bandwidth),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_channel),
//  ESP_ELFSYM_EXPORT(esp_wifi_get_channel),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_country),
//  ESP_ELFSYM_EXPORT(esp_wifi_get_country),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_mac),
    ESP_ELFSYM_EXPORT(esp_wifi_get_mac),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_promiscuous_rx_cb),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_promiscuous),
//  ESP_ELFSYM_EXPORT(esp_wifi_get_promiscuous),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_promiscuous_filter),
//  ESP_ELFSYM_EXPORT(esp_wifi_get_promiscuous_filter),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_promiscuous_ctrl_filter),
//  ESP_ELFSYM_EXPORT(esp_wifi_get_promiscuous_ctrl_filter),
    ESP_ELFSYM_EXPORT(esp_wifi_set_config),
//  ESP_ELFSYM_EXPORT(esp_wifi_get_config),
    ESP_ELFSYM_EXPORT(esp_wifi_ap_get_sta_list),
//  ESP_ELFSYM_EXPORT(esp_wifi_ap_get_sta_aid),
    ESP_ELFSYM_EXPORT(esp_wifi_set_storage),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_vendor_ie),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_vendor_ie_cb),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_max_tx_power),
//  ESP_ELFSYM_EXPORT(esp_wifi_get_max_tx_power),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_event_mask),
//  ESP_ELFSYM_EXPORT(esp_wifi_get_event_mask),
//  ESP_ELFSYM_EXPORT(esp_wifi_80211_tx),
#if 0
    ESP_ELFSYM_EXPORT(esp_wifi_set_csi_rx_cb),
    ESP_ELFSYM_EXPORT(esp_wifi_set_csi_config),
    ESP_ELFSYM_EXPORT(esp_wifi_get_csi_config),
    ESP_ELFSYM_EXPORT(esp_wifi_set_csi),
#endif
//  ESP_ELFSYM_EXPORT(esp_wifi_get_tsf_time),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_inactive_time),
//  ESP_ELFSYM_EXPORT(esp_wifi_statis_dump),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_rssi_threshold),
//  ESP_ELFSYM_EXPORT(esp_wifi_ftm_initiate_session),
//  ESP_ELFSYM_EXPORT(esp_wifi_ftm_end_session),
//  ESP_ELFSYM_EXPORT(esp_wifi_ftm_resp_set_offset),
//  ESP_ELFSYM_EXPORT(esp_wifi_ftm_get_report),
//  ESP_ELFSYM_EXPORT(esp_wifi_config_11b_rate),
//  ESP_ELFSYM_EXPORT(esp_wifi_connectionless_module_set_wake_interval),
//  ESP_ELFSYM_EXPORT(esp_wifi_force_wakeup_acquire),
//  ESP_ELFSYM_EXPORT(esp_wifi_force_wakeup_release),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_country_code),
//  ESP_ELFSYM_EXPORT(esp_wifi_get_country_code),
//  ESP_ELFSYM_EXPORT(esp_wifi_config_80211_tx_rate),
//  ESP_ELFSYM_EXPORT(esp_wifi_disable_pmf_config),
//  ESP_ELFSYM_EXPORT(esp_wifi_sta_get_aid),
//  ESP_ELFSYM_EXPORT(esp_wifi_sta_get_negotiated_phymode),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_dynamic_cs),
//  ESP_ELFSYM_EXPORT(esp_wifi_sta_get_rssi),

    // esp_wifi_default
//  ESP_ELFSYM_EXPORT(esp_netif_attach_wifi_station),
//  ESP_ELFSYM_EXPORT(esp_netif_attach_wifi_ap),
    ESP_ELFSYM_EXPORT(esp_wifi_set_default_wifi_sta_handlers),
    ESP_ELFSYM_EXPORT(esp_wifi_set_default_wifi_ap_handlers),
//  ESP_ELFSYM_EXPORT(esp_wifi_set_default_wifi_nan_handlers),
    ESP_ELFSYM_EXPORT(esp_wifi_clear_default_wifi_driver_and_handlers),
    ESP_ELFSYM_EXPORT(esp_netif_create_default_wifi_ap),
    ESP_ELFSYM_EXPORT(esp_netif_create_default_wifi_sta),
//  ESP_ELFSYM_EXPORT(esp_netif_create_default_wifi_nan),
//  ESP_ELFSYM_EXPORT(esp_netif_destroy_default_wifi),
//  ESP_ELFSYM_EXPORT(esp_netif_create_wifi),
//  ESP_ELFSYM_EXPORT(esp_netif_create_default_wifi_mesh_netifs),

    // freertos
    ESP_ELFSYM_EXPORT(vTaskDelay),
    ESP_ELFSYM_EXPORT(vTaskDelete),
    ESP_ELFSYM_EXPORT(xTaskCreatePinnedToCore),
    ESP_ELFSYM_EXPORT(xTaskGetTickCount),
    ESP_ELFSYM_EXPORT(xTimerCreate),
    ESP_ELFSYM_EXPORT(xTimerGenericCommand),

    // hap
//  ESP_ELFSYM_EXPORT(hap_set_debug_level),
    ESP_ELFSYM_EXPORT(hap_get_version),
    ESP_ELFSYM_EXPORT(hap_get_config),
    ESP_ELFSYM_EXPORT(hap_set_config),
//  ESP_ELFSYM_EXPORT(hap_update_config_number),
    ESP_ELFSYM_EXPORT(hap_init),
//  ESP_ELFSYM_EXPORT(hap_deinit),
    ESP_ELFSYM_EXPORT(hap_start),
//  ESP_ELFSYM_EXPORT(hap_stop),
    ESP_ELFSYM_EXPORT(hap_acc_create),
//  ESP_ELFSYM_EXPORT(hap_acc_add_accessory_flags),
//  ESP_ELFSYM_EXPORT(hap_acc_update_accessory_flags),
//  ESP_ELFSYM_EXPORT(hap_acc_add_product_data),
//  ESP_ELFSYM_EXPORT(hap_acc_add_wifi_transport_service),
    ESP_ELFSYM_EXPORT(hap_add_accessory),
//  ESP_ELFSYM_EXPORT(hap_add_bridged_accessory),
//  ESP_ELFSYM_EXPORT(hap_remove_bridged_accessory),
//  ESP_ELFSYM_EXPORT(hap_acc_delete),
//  ESP_ELFSYM_EXPORT(hap_delete_all_accessories),
//  ESP_ELFSYM_EXPORT(hap_get_unique_aid),
//  ESP_ELFSYM_EXPORT(hap_acc_get_by_aid),
//  ESP_ELFSYM_EXPORT(hap_get_first_acc),
//  ESP_ELFSYM_EXPORT(hap_acc_get_next),
//  ESP_ELFSYM_EXPORT(hap_acc_get_serv_by_iid),
//  ESP_ELFSYM_EXPORT(hap_acc_get_serv_by_uuid),
//  ESP_ELFSYM_EXPORT(hap_acc_get_char_by_iid),
//  ESP_ELFSYM_EXPORT(hap_acc_get_first_serv),
//  ESP_ELFSYM_EXPORT(hap_char_bool_create),
//  ESP_ELFSYM_EXPORT(hap_char_uint8_create),
//  ESP_ELFSYM_EXPORT(hap_char_uint16_create),
//  ESP_ELFSYM_EXPORT(hap_char_uint32_create),
//  ESP_ELFSYM_EXPORT(hap_char_uint64_create),
//  ESP_ELFSYM_EXPORT(hap_char_int_create),
//  ESP_ELFSYM_EXPORT(hap_char_float_create),
//  ESP_ELFSYM_EXPORT(hap_char_string_create),
//  ESP_ELFSYM_EXPORT(hap_char_data_create),
//  ESP_ELFSYM_EXPORT(hap_char_tlv8_create),
//  ESP_ELFSYM_EXPORT(hap_char_delete),
//  ESP_ELFSYM_EXPORT(hap_serv_create),
//  ESP_ELFSYM_EXPORT(hap_serv_delete),
//  ESP_ELFSYM_EXPORT(hap_acc_get_aid),
//  ESP_ELFSYM_EXPORT(hap_serv_get_char_by_uuid),
    ESP_ELFSYM_EXPORT(hap_serv_get_parent),
//  ESP_ELFSYM_EXPORT(hap_serv_get_next),
//  ESP_ELFSYM_EXPORT(hap_serv_get_first_char),
//  ESP_ELFSYM_EXPORT(hap_char_get_iid),
    ESP_ELFSYM_EXPORT(hap_char_get_type_uuid),
//  ESP_ELFSYM_EXPORT(hap_char_get_perm),
//  ESP_ELFSYM_EXPORT(hap_char_get_format),
//  ESP_ELFSYM_EXPORT(hap_serv_get_iid),
    ESP_ELFSYM_EXPORT(hap_serv_get_type_uuid),
    ESP_ELFSYM_EXPORT(hap_char_get_parent),
//  ESP_ELFSYM_EXPORT(hap_char_get_next),
//  ESP_ELFSYM_EXPORT(hap_char_int_set_constraints),
//  ESP_ELFSYM_EXPORT(hap_char_float_set_constraints),
//  ESP_ELFSYM_EXPORT(hap_char_string_set_maxlen),
//  ESP_ELFSYM_EXPORT(hap_char_add_description),
//  ESP_ELFSYM_EXPORT(hap_char_add_unit),
//  ESP_ELFSYM_EXPORT(hap_char_add_valid_vals),
//  ESP_ELFSYM_EXPORT(hap_char_add_valid_vals_range),
//  ESP_ELFSYM_EXPORT(hap_char_set_iid),
    ESP_ELFSYM_EXPORT(hap_serv_add_char),
    ESP_ELFSYM_EXPORT(hap_acc_add_serv),
    ESP_ELFSYM_EXPORT(hap_char_update_val),
//  ESP_ELFSYM_EXPORT(hap_char_get_val),
    ESP_ELFSYM_EXPORT(hap_serv_set_write_cb),
    ESP_ELFSYM_EXPORT(hap_serv_set_read_cb),
//  ESP_ELFSYM_EXPORT(hap_serv_set_bulk_read_cb),
//  ESP_ELFSYM_EXPORT(hap_serv_set_priv),
//  ESP_ELFSYM_EXPORT(hap_serv_get_priv),
//  ESP_ELFSYM_EXPORT(hap_serv_mark_primary),
//  ESP_ELFSYM_EXPORT(hap_serv_mark_hidden),
//  ESP_ELFSYM_EXPORT(hap_serv_link_serv),
//  ESP_ELFSYM_EXPORT(hap_serv_set_iid),
//  ESP_ELFSYM_EXPORT(hap_set_setup_info),
    ESP_ELFSYM_EXPORT(hap_set_setup_code),
    ESP_ELFSYM_EXPORT(hap_set_setup_id),
#if 0
    ESP_ELFSYM_EXPORT(hap_check_mfi_chip),
#endif
    ESP_ELFSYM_EXPORT(hap_reboot_accessory),
    ESP_ELFSYM_EXPORT(hap_reset_to_factory),
    ESP_ELFSYM_EXPORT(hap_reset_network),
    ESP_ELFSYM_EXPORT(hap_reset_homekit_data),
    ESP_ELFSYM_EXPORT(hap_reset_pairings),
//  ESP_ELFSYM_EXPORT(hap_is_req_admin),
    ESP_ELFSYM_EXPORT(hap_req_get_ctrl_id),
//  ESP_ELFSYM_EXPORT(hap_factory_keystore_get),
//  ESP_ELFSYM_EXPORT(hap_enable_mfi_auth),
//  ESP_ELFSYM_EXPORT(hap_register_event_handler),
    ESP_ELFSYM_EXPORT(hap_get_paired_controller_count),
//  ESP_ELFSYM_EXPORT(hap_http_debug_enable),
//  ESP_ELFSYM_EXPORT(hap_http_debug_disable),
//  ESP_ELFSYM_EXPORT(esp_hap_get_setup_payload),
//  ESP_ELFSYM_EXPORT(hap_pair_setup_re_enable),

