NyankoLab/esp32c3-elf/module/symbols.c
    // hap_apple_chars
    ESP_ELFSYM_EXPORT(hap_char_brightness_create),
    ESP_ELFSYM_EXPORT(hap_char_cooling_threshold_temperature_create),
    ESP_ELFSYM_EXPORT(hap_char_current_door_state_create),
    ESP_ELFSYM_EXPORT(hap_char_current_heating_cooling_state_create),
    ESP_ELFSYM_EXPORT(hap_char_current_relative_humidity_create),
    ESP_ELFSYM_EXPORT(hap_char_current_temperature_create),
    ESP_ELFSYM_EXPORT(hap_char_firmware_revision_create),
    ESP_ELFSYM_EXPORT(hap_char_hardware_revision_create),
    ESP_ELFSYM_EXPORT(hap_char_heating_threshold_temperature_create),
    ESP_ELFSYM_EXPORT(hap_char_hue_create),
    ESP_ELFSYM_EXPORT(hap_char_identify_create),
    ESP_ELFSYM_EXPORT(hap_char_lock_current_state_create),
    ESP_ELFSYM_EXPORT(hap_char_lock_target_state_create),
    ESP_ELFSYM_EXPORT(hap_char_manufacturer_create),
    ESP_ELFSYM_EXPORT(hap_char_model_create),
    ESP_ELFSYM_EXPORT(hap_char_motion_detected_create),
    ESP_ELFSYM_EXPORT(hap_char_name_create),
    ESP_ELFSYM_EXPORT(hap_char_obstruction_detect_create),
    ESP_ELFSYM_EXPORT(hap_char_on_create),
    ESP_ELFSYM_EXPORT(hap_char_outlet_in_use_create),
    ESP_ELFSYM_EXPORT(hap_char_rotation_direction_create),
    ESP_ELFSYM_EXPORT(hap_char_rotation_speed_create),
    ESP_ELFSYM_EXPORT(hap_char_saturation_create),
    ESP_ELFSYM_EXPORT(hap_char_serial_number_create),
    ESP_ELFSYM_EXPORT(hap_char_target_door_state_create),
    ESP_ELFSYM_EXPORT(hap_char_target_heating_cooling_state_create),
    ESP_ELFSYM_EXPORT(hap_char_target_relative_humidity_create),
    ESP_ELFSYM_EXPORT(hap_char_target_temperature_create),
    ESP_ELFSYM_EXPORT(hap_char_temperature_display_units_create),
    ESP_ELFSYM_EXPORT(hap_char_version_create),
    ESP_ELFSYM_EXPORT(hap_char_security_system_current_state_create),
    ESP_ELFSYM_EXPORT(hap_char_security_system_target_state_create),
    ESP_ELFSYM_EXPORT(hap_char_battery_level_create),
    ESP_ELFSYM_EXPORT(hap_char_current_position_create),
    ESP_ELFSYM_EXPORT(hap_char_current_vertical_tilt_angle_create),
    ESP_ELFSYM_EXPORT(hap_char_hold_position_create),
    ESP_ELFSYM_EXPORT(hap_char_leak_detected_create),
    ESP_ELFSYM_EXPORT(hap_char_occupancy_detected_create),
    ESP_ELFSYM_EXPORT(hap_char_status_active_create),
    ESP_ELFSYM_EXPORT(hap_char_smoke_detected_create),
    ESP_ELFSYM_EXPORT(hap_char_status_fault_create),
    ESP_ELFSYM_EXPORT(hap_char_status_low_battery_create),
    ESP_ELFSYM_EXPORT(hap_char_status_tampered_create),
    ESP_ELFSYM_EXPORT(hap_char_target_horizontal_tilt_angle_create),
    ESP_ELFSYM_EXPORT(hap_char_target_position_create),
    ESP_ELFSYM_EXPORT(hap_char_target_vertical_tilt_angle_create),
    ESP_ELFSYM_EXPORT(hap_char_security_system_alarm_type_create),
    ESP_ELFSYM_EXPORT(hap_char_charging_state_create),
    ESP_ELFSYM_EXPORT(hap_char_carbon_monoxide_level_create),
    ESP_ELFSYM_EXPORT(hap_char_carbon_monoxide_peak_level_create),
    ESP_ELFSYM_EXPORT(hap_char_carbon_dioxide_detected_create),
    ESP_ELFSYM_EXPORT(hap_char_carbon_dioxide_level_create),
    ESP_ELFSYM_EXPORT(hap_char_carbon_dioxide_peak_level_create),
    ESP_ELFSYM_EXPORT(hap_char_carbon_monoxide_detected_create),
    ESP_ELFSYM_EXPORT(hap_char_contact_sensor_state_create),
    ESP_ELFSYM_EXPORT(hap_char_current_ambient_light_level_create),
    ESP_ELFSYM_EXPORT(hap_char_current_horizontal_tilt_angle_create),
    ESP_ELFSYM_EXPORT(hap_char_air_quality_create),
    ESP_ELFSYM_EXPORT(hap_char_accessory_flags_create),
    ESP_ELFSYM_EXPORT(hap_char_product_data_create),
    ESP_ELFSYM_EXPORT(hap_char_lock_physical_controls_create),
    ESP_ELFSYM_EXPORT(hap_char_current_air_purifier_state_create),
    ESP_ELFSYM_EXPORT(hap_char_current_slat_state_create),
    ESP_ELFSYM_EXPORT(hap_char_slat_type_create),
    ESP_ELFSYM_EXPORT(hap_char_filter_life_level_create),
    ESP_ELFSYM_EXPORT(hap_char_filter_change_indication_create),
    ESP_ELFSYM_EXPORT(hap_char_reset_filter_indication_create),
    ESP_ELFSYM_EXPORT(hap_char_target_air_purifier_state_create),
    ESP_ELFSYM_EXPORT(hap_char_target_fan_state_create),
    ESP_ELFSYM_EXPORT(hap_char_current_fan_state_create),
    ESP_ELFSYM_EXPORT(hap_char_position_state_create),
    ESP_ELFSYM_EXPORT(hap_char_programmable_switch_event_create),
    ESP_ELFSYM_EXPORT(hap_char_active_create),
    ESP_ELFSYM_EXPORT(hap_char_swing_mode_create),
    ESP_ELFSYM_EXPORT(hap_char_current_tilt_angle_create),
    ESP_ELFSYM_EXPORT(hap_char_target_tilt_angle_create),
    ESP_ELFSYM_EXPORT(hap_char_ozone_density_create),
    ESP_ELFSYM_EXPORT(hap_char_nitrogen_dioxide_density_create),
    ESP_ELFSYM_EXPORT(hap_char_sulphur_dioxide_density_create),
    ESP_ELFSYM_EXPORT(hap_char_pm_2_5_density_create),
    ESP_ELFSYM_EXPORT(hap_char_pm_10_density_create),
    ESP_ELFSYM_EXPORT(hap_char_voc_density_create),
    ESP_ELFSYM_EXPORT(hap_char_service_label_index_create),
    ESP_ELFSYM_EXPORT(hap_char_service_label_namespace_create),
    ESP_ELFSYM_EXPORT(hap_char_color_temperature_create),
    ESP_ELFSYM_EXPORT(hap_char_current_heater_cooler_state_create),
    ESP_ELFSYM_EXPORT(hap_char_target_heater_cooler_state_create),
    ESP_ELFSYM_EXPORT(hap_char_current_humidifier_dehumidifier_state_create),
    ESP_ELFSYM_EXPORT(hap_char_target_humidifier_dehumidifier_state_create),
    ESP_ELFSYM_EXPORT(hap_char_water_level_create),
    ESP_ELFSYM_EXPORT(hap_char_relative_humidity_dehumidifier_threshold_create),
    ESP_ELFSYM_EXPORT(hap_char_relative_humidity_humidifier_threshold_create),
    ESP_ELFSYM_EXPORT(hap_char_program_mode_create),
    ESP_ELFSYM_EXPORT(hap_char_in_use_create),
    ESP_ELFSYM_EXPORT(hap_char_set_duration_create),
    ESP_ELFSYM_EXPORT(hap_char_remaining_duration_create),
    ESP_ELFSYM_EXPORT(hap_char_valve_type_create),
    ESP_ELFSYM_EXPORT(hap_char_is_configured_create),
    ESP_ELFSYM_EXPORT(hap_char_status_jammed_create),
    ESP_ELFSYM_EXPORT(hap_char_administrator_only_access_create),
    ESP_ELFSYM_EXPORT(hap_char_lock_control_point_create),
    ESP_ELFSYM_EXPORT(hap_char_lock_last_known_action_create),
    ESP_ELFSYM_EXPORT(hap_char_lock_management_auto_security_timeout_create),
    ESP_ELFSYM_EXPORT(hap_char_logs_create),
    ESP_ELFSYM_EXPORT(hap_char_air_particulate_density_create),
    ESP_ELFSYM_EXPORT(hap_char_air_particulate_size_create),

    // hap_apple_servs
    ESP_ELFSYM_EXPORT(hap_serv_accessory_information_create),
    ESP_ELFSYM_EXPORT(hap_serv_protocol_information_create),
    ESP_ELFSYM_EXPORT(hap_serv_fan_create),
    ESP_ELFSYM_EXPORT(hap_serv_garage_door_opener_create),
    ESP_ELFSYM_EXPORT(hap_serv_lightbulb_create),
    ESP_ELFSYM_EXPORT(hap_serv_lock_management_create),
    ESP_ELFSYM_EXPORT(hap_serv_lock_mechanism_create),
    ESP_ELFSYM_EXPORT(hap_serv_outlet_create),
    ESP_ELFSYM_EXPORT(hap_serv_switch_create),
    ESP_ELFSYM_EXPORT(hap_serv_thermostat_create),
    ESP_ELFSYM_EXPORT(hap_serv_air_quality_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_security_system_create),
    ESP_ELFSYM_EXPORT(hap_serv_carbon_monoxide_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_contact_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_door_create),
    ESP_ELFSYM_EXPORT(hap_serv_humidity_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_leak_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_light_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_motion_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_occupancy_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_smoke_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_stateless_programmable_switch_create),
    ESP_ELFSYM_EXPORT(hap_serv_temperature_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_window_create),
    ESP_ELFSYM_EXPORT(hap_serv_window_covering_create),
    ESP_ELFSYM_EXPORT(hap_serv_battery_service_create),
    ESP_ELFSYM_EXPORT(hap_serv_carbon_dioxide_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_fan_v2_create),
    ESP_ELFSYM_EXPORT(hap_serv_slat_create),
    ESP_ELFSYM_EXPORT(hap_serv_filter_maintenance_create),
    ESP_ELFSYM_EXPORT(hap_serv_air_purifier_create),
    ESP_ELFSYM_EXPORT(hap_serv_heater_cooler_create),
    ESP_ELFSYM_EXPORT(hap_serv_humidifier_dehumidifier_create),
    ESP_ELFSYM_EXPORT(hap_serv_service_label_create),
    ESP_ELFSYM_EXPORT(hap_serv_irrigation_system_create),
    ESP_ELFSYM_EXPORT(hap_serv_valve_create),
    ESP_ELFSYM_EXPORT(hap_serv_faucet_create),

    // hap_controllers
    ESP_ELFSYM_EXPORT(is_accessory_paired),
    ESP_ELFSYM_EXPORT(is_admin_paired),

    // hap_database
    ESP_ELFSYM_EXPORT(hap_get_acc_id),

    // chip
    ESP_ELFSYM_EXPORT(_ZN4chip26CommissioningWindowManager28OpenBasicCommissioningWindowENSt3__16chrono8durationIjNS1_5ratioILx1ELx1EEEEENS_32CommissioningWindowAdvertisementE),
    ESP_ELFSYM_EXPORT(_ZNK4chip26CommissioningWindowManager25IsCommissioningWindowOpenEv),
    ESP_ELFSYM_EXPORT(_ZN4chip11DeviceLayer29SetDeviceInstanceInfoProviderEPNS0_26DeviceInstanceInfoProviderE),
    ESP_ELFSYM_EXPORT(_ZN4chip6Server7sServerE),

    // esp-matter
    ESP_ELFSYM_EXPORT(_Z18esp_matter_invalidPv),
    ESP_ELFSYM_EXPORT(_ZN10esp_matter9attribute7get_valEtjjP21esp_matter_attr_val_t),
    ESP_ELFSYM_EXPORT(_ZN10esp_matter9attribute6updateEtjjP21esp_matter_attr_val_t),
    ESP_ELFSYM_EXPORT(_ZN10esp_matter8endpoint6get_idEPj),
    ESP_ELFSYM_EXPORT(_ZN10esp_matter8endpoint13get_priv_dataEt),
    ESP_ELFSYM_EXPORT(_ZN10esp_matter8endpoint20room_air_conditioner6createEPjPNS1_6configEhPv),
    ESP_ELFSYM_EXPORT(_ZN10esp_matter13factory_resetEv),
    ESP_ELFSYM_EXPORT(_ZN10esp_matter10is_startedEv),
    ESP_ELFSYM_EXPORT(_ZN10esp_matter4node6createEPNS0_6configEPFiNS_9attribute13callback_typeEtjjP21esp_matter_attr_val_tPvEPFiNS_14identification13callback_typeEthhS7_ES7_),
    ESP_ELFSYM_EXPORT(_ZN10esp_matter5startEPFvPKN4chip11DeviceLayer15ChipDeviceEventEiEi),

    // end
    ESP_ELFSYM_END
};
